Repository: yeager/swedish-tm
Catalog: reviewed/catalogs/mailfromd.tmx
Source language: en
Languages: sv

source: missing module declaration
sv: saknar moduldeklaration

source: cannot create mailbox `%s': %s
sv: kan inte skapa brevlåda `%s': %s

source: error: %s
sv: fel: %s

source: expected "%s", but got %s
sv: förväntade sig "%s", men fick %s

source: cannot open directory %s: %s
sv: kan inte öppna katalogen %s: %s

source: %scannot create temporary stream: %s
sv: %skan inte skapa tillfällig ström: %s

source: symbol import conflict: %s
sv: konflikt vid symbolimport: %s

source: unable to start external preprocessor `%s': %s
sv: kan inte starta den externa förprocessorn `%s': %s

source: %s failed: %s
sv: %s misslyckades: %s

source: recursive inclusion
sv: rekursiv inkludering

source: duplicate `%s'
sv: duplikat `%s'

source: misplaced `module'
sv: felplacerad `modul'

source: expected numeric value, but found `%s'
sv: förväntat numeriskt värde, men hittade `%s'

source: greylist database %s has wrong data size
sv: greylistdatabasen %s har fel datastorlek

source: Trace executed actions.
sv: Spåra utförda åtgärder.

source: incorrect mode near `%s'
sv: felaktigt läge nära `%s'

source: header not found
sv: rubriken hittades inte

source: unknown timeout class: %s
sv: okänd timeout klass: %s

source: %s: cannot get path: %s
sv: %s: kan inte få sökväg: %s

source: run in daemon mode (default)
sv: körs i daemon-läge (standard)

source: run script and execute function FUNC ("main" if not given)
sv: kör skript och exekvera funktionen FUNC ("main" om den inte anges)

source: %s: shan_connect: inet_aton(%s) failed
sv: %s: shan_connect: inet_aton(%s) misslyckades

source: tempfail code should be 4xx
sv: tempfail-koden bör vara 4xx

source: trace executed actions
sv: spåra utförda åtgärder

source: Sendmail action is not allowed in end block
sv: Sendmail-åtgärder är inte tillåtna i slutblocket

source: Enable transcript of call-out SMTP sessions.
sv: Aktivera transkribering av SMTP-sessioner med utrop.

source: unknown flag
sv: okänd flagga

source: invalid size suffix (near %s)
sv: ogiltigt storlekssuffix (nära %s)

source: error initialising variable %s: incompatible types
sv: fel vid initialisering av variabel %s: inkompatibla typer

source: invalid transform string: %s
sv: ogiltig transformationssträng: %s

source: nothing to pop
sv: inget att poppa

source: transition from state %s to %s is prohibited
sv: övergång från tillstånd %s till %s är förbjuden

source: unknown exception: %d: %s
sv: okänt undantag: %d: %s

source: %s: shan_connect: unknown family %d
sv: %s: shan_connect: okänd familj %d

source: argument out of range: start=%ld, len=%ld
sv: argument utanför intervallet: start=%ld, len=%ld

source: DB file name to operate upon
sv: DB-filnamn att arbeta med

source: left-hand side argument to match is of wrong data type
sv: vänster sidas argument för matchning är av fel datatyp

source: %s: error parsing URL
sv: %s: fel vid analys av URL

source: %s: %s: UNIX socket name too long
sv: %s: %s: UNIX-uttagsnamn för långt

source: argument out of range: count=%ld
sv: argument utanför intervallet: count=%ld

source: %s: user not found
sv: %s: användaren hittades inte

source: `next' is used outside `loop'; did you mean `pass'?
sv: `next' används utanför `loop'; menade du `pass'?

source: error reading reply to '%c': %s
sv: fel vid läsning av svar till '%c': %s

source: unable to create database %s: %s
sv: det går inte att skapa en databas %s: %s

source: preprocessor exited with status %d
sv: preprocessorn avslutades med status %d

source: %s: exception on control fd
sv: %s: undantag på kontroll fd

source: failed to get PTR record for %s
sv: lyckades inte få PTR-rekord för %s

source: Configuration modifiers
sv: Konfigurationsmodifierare

source: Listen for milter requests on the given URL.
sv: Lyssna efter milter-förfrågningar på den angivna URL:en.

source: cannot create transcript filterstream: %s
sv: kan inte skapa transkript filterström: %s

source: no such user: %s
sv: ingen sådan användare: %s

source: set database expiration interval to NUMBER seconds
sv: ställa in databasens utgångsintervall till ANTAL sekunder

source: no more mailboxes available
sv: inga fler brevlådor tillgängliga

source: %s: %s: cannot unlink: %s
sv: %s: %s: kan inte ta bort länken: %s

source: terminating subprocesses
sv: avsluta delprocesser

source: %s: cannot stat socket: %s
sv: %s: kan inte stat socket: %s

source: value out of range: %s
sv: värde utanför intervallet: %s

source: this is the location of the previous initialization
sv: detta är platsen för den tidigare initialiseringen

source: %s: cannot listen on port %s: %s
sv: %s: kan inte lyssna på port %s: %s

source: file
sv: fil

source: socket `%s' already exists
sv: uttaget `%s' finns redan

source: connection not initialized
sv: anslutningen inte initierad

source: %s: not a valid X spec, missing port
sv: %s: inte en giltig X-specifikation, port saknas

source: invalid data type, expected number
sv: ogiltig datatyp, förväntat tal

source: Set connect timeout.
sv: Ställ in tidsgräns för anslutning.

source: Reuse existing socket (default).
sv: Återanvänd befintligt uttag (standard).

source: `precious' used with func
sv: "värdefull" används med func

source: macro not defined: %s
sv: makro ej definierat: %s

source: left-hand side argument to the arithmetical operation is of wrong data type
sv: vänster sidas argument till den aritmetiska operationen är av fel datatyp

source: %s: shan_optneg: MTA flags %#lx do not match protocol requirements %#lx
sv: %s: shan_optneg: MTA-flaggorna %#lx stämmer inte överens med protokollkraven %#lx

source: INTERNAL ERROR: pragma %s already defined
sv: INTERNT FEL: pragma %s redan definierad

source: cannot change to %s: %s
sv: kan inte ändras till %s: %s

source: end of file in comment
sv: slutet av filen i kommentar

source: unexpected end of file in canonical stream
sv: oväntat slut på fil i kanonisk ström

source: compile files
sv: kompilera filer

source: unsupported logger stream: %s
sv: logger-ström som inte stöds: %s

source: automatic variable `%s' is shadowing a parameter
sv: automatisk variabel `%s' skuggar en parameter

source: child %lu stopped on signal %d
sv: barn %lu stoppas vid signal %d

source: cannot create PID file `%s': %s
sv: kan inte skapa PID-filen `%s': %s

source: bad recipient address `%s': %s
sv: felaktig mottagaradress `%s': %s

source: imported symbol location
sv: plats för importerad symbol

source: Pass auth macros to MAIL handler.
sv: Skicka auth-makron till MAIL-hanteraren.

source: INTERNAL ERROR at %s:%d: variable to be initialized is not declared
sv: INTERNT FEL vid %s:%d: variabel som ska initieras är inte deklarerad

source: %s: file %s is not a socket
sv: %s: filen %s är inte ett uttag

source: read failed: %s
sv: läsning misslyckades: %s

source: cannot fork: %s
sv: kan inte gaffla: %s

source: exception code not a number
sv: undantagskod inte ett nummer

source: %stemporary stream write failed: %s
sv: %sskrivning av tillfällig ström misslyckades: %s

source: %s: listen on %s failed: %s
sv: %s: lyssna på %s misslyckades: %s

source: cannot create database URL for %s: %s
sv: kan inte skapa databas-URL för %s: %s

source: add the directory DIR to the list of directories to be searched for header files
sv: lägg till katalogen DIR i listan över kataloger som ska genomsökas efter header-filer

source: mailfromd terminated with unrecognized status
sv: mailfromd avslutat med okänd status

source: back reference out of range
sv: bakre referens utanför intervallet

source: unknown server type
sv: okänd servertyp

source: unable to record current working directory: %s
sv: kan inte registrera aktuell arbetskatalog: %s

source: compact the database
sv: komprimera databasen

source: cannot reallocate stream buffer
sv: kan inte omfördela strömbufferten

source: this is the location of the previous definition
sv: detta är platsen för den tidigare definitionen

source: `%s' already included at top level
sv: `%s' redan inkluderad på toppnivå

source: mfdbtool -- Mailfromd database management tool
sv: mfdbtool -- Verktyg för hantering av Mailfromd-databasen

source: Preprocessor command line stub.
sv: Preprocessor kommandoradsstub.

source: xxfi_negotiate returned %d (protocol options=0x%lx, actions=0x%lx)
sv: xxfi_negotiate returnerade %d (protokollalternativ=0x%lx, åtgärder=0x%lx)

source: too many arguments to define-macros
sv: för många argument till define-makron

source: stack segment expanded, new size=%lu
sv: stacksegmentet utökat, ny storlek=%lu

source: unrecongized state id %ld
sv: orecongongized state id %ld

source: cannot get URL scheme: %s
sv: kan inte få URL-schema: %s

source: cannot get URL host: %s
sv: kan inte hämta URL-värd: %s

source: Maximum number of dynamically loaded modules.
sv: Maximalt antal dynamiskt laddade moduler.

source: add DIR to the load path
sv: lägg till DIR i laddningsstigen

source: EOF on %s
sv: EOF på %s

source: list given database (default cache)
sv: lista given databas (standard cache)

source: conflicting symbol location
sv: motstridig symbolplacering

source: `break' used outside of `loop'
sv: `break' används utanför `loop'

source: dir: string
sv: dir: sträng

source: bad numeric file mode
sv: dåligt numeriskt filläge

source: unknown command: %c
sv: okänt kommando: %c

source: %s fails safety check: %s
sv: %s misslyckas med säkerhetskontrollen: %s

source: initializer element is not numeric
sv: initialiseringselementet är inte numeriskt

source: but you use version %s
sv: men du använder version %s

source: Set SMTP timeouts.
sv: Ange tidsgränser för SMTP.

source: variable %s is not defined
sv: variabeln %s är inte definierad

source: show used Sendmail macros
sv: visa använda Sendmail-makron

source: %s: unknown host name %s
sv: %s: okänt värdnamn %s

source: expression evaluates to unspecified data type
sv: uttrycket utvärderas till ospecificerad datatyp

source: invalid timeout near %s
sv: ogiltig timeout nära %s

source: cannot connect to the milter using %s
sv: kan inte ansluta till miltern med hjälp av %s

source: child %lu dumped core
sv: barn %lu dumpade kärnan

source: %s: wrote 0 bytes
sv: %s: skrev 0 byte

source: load library
sv: ladda bibliotek

source: message is not a RFC-934 digest
sv: meddelandet är inte en RFC-934-digest

source: NAME[=VALUE]
sv: NAMN[=VÄRDE]

source: error encoding string: %s
sv: fel kodningssträng: %s

source: %s: stream_write: wrote 0 bytes
sv: %s: stream_write: skrev 0 byte

source: can't unlink %s: %s
sv: kan inte ta bort länken %s: %s

source: warning: no such variable: %s
sv: varning: ingen sådan variabel: %s

source: unexpected end of file
sv: oväntat slut på filen

source: VAR=VALUE
sv: VAR=VÄRDE

source: Define a database.
sv: Definiera en databas.

source: arg: milter [version: number]|pmilter
sv: arg: milter [version: nummer]|pmilter

source: INTERNAL ERROR at %s:%d, declaring %s %s
sv: INTERNT FEL vid %s:%d, deklarerar %s %s

source: second setuid(%lu) failed: %s
sv: andra setuid(%lu) misslyckades: %s

source: client type %s is not supported yet
sv: klienttyp %s stöds inte ännu

source: server %s: too many children (%lu)
sv: server %s: för många barn (%lu)

source: define Sendmail macro
sv: define Sendmail makro

source: end of file reached
sv: slutet av filen har nåtts

source: stack underflow
sv: stack underflöde

source: set debugging level
sv: ställa in felsökningsnivå

source: time: interval
sv: tid: intervall

source: child %lu terminated on signal %d
sv: barn %lu avslutat på signal %d

source: %s handler returned failure
sv: %s handläggaren returnerade fel

source: cannot open input stream: %s
sv: kan inte öppna inmatningsström: %s

source: buffer size out of allowed range
sv: buffertstorlek utanför tillåtet intervall

source: too many arguments in pragma
sv: för många argument i pragma

source: set code optimization level
sv: ställa in kodoptimeringsnivå

source: Search path for dynamically loaded modules.
sv: Sökväg för dynamiskt laddade moduler.

source: %s: cannot get scheme: %s
sv: %s: kan inte få schema: %s

source: %s: not a valid X spec, missing = near %s
sv: %s: inte en giltig X-specifikation, saknas = nära %s

source: Informational and debugging options
sv: Informations- och felsökningsalternativ

source: cannot get URL port: %s
sv: kan inte hämta URL-port: %s

source: left-hand side argument to fnmatch is of wrong data type
sv: vänster sidas argument till fnmatch är av fel datatyp

source: %s: not a valid X spec, duplicate field %s
sv: %s: inte en giltig X-specifikation, duplicerat fält %s

source: ranges in source set must be in ascending order
sv: intervallen i källuppsättningen måste vara i stigande ordning

source: `precious' used with const
sv: `precious' används med const

source: %s: %s: cannot stat socket: %s
sv: %s: %s: kan inte stat socket: %s

source: Set negative expiration interval (for database id "cache")
sv: Ange negativt utgångsintervall (för databas-ID "cache")

source: too few arguments in call to `%s'
sv: för få argument i anropet till `%s'

source: child %lu failed with status %d
sv: barn %lu misslyckades med status %d

source: use of uninitialized variable '%s'
sv: användning av oinitialiserad variabel '%s'

source: check syntax and exit
sv: kontrollera syntax och avsluta

source: mailfromd terminated on signal %d
sv: mailfromd avslutat på signal %d

source: Maximum number of messages to open simultaneously.
sv: Maximalt antal meddelanden som kan öppnas samtidigt.

source: bad response from clamav: expected `PORT' but found `%s'
sv: dåligt svar från clamav: förväntade sig `PORT' men fann `%s'

source: %s: cannot unlink file %s: %s
sv: %s: kan inte avlänka fil %s: %s

source: right-hand side argument to match is of wrong data type (should not happen)
sv: höger sidas argument för matchning är av fel datatyp (ska inte hända)

source: %s [%lu] failed with status %d
sv: %s [%lu] misslyckades med status %d

source: Configure server.
sv: Konfigurera servern.

source: cannot define variable of unspecified type
sv: kan inte definiera variabel av ospecificerad typ

source: Cannot insert datum `%-.*s' in greylist database %s: %s
sv: Det går inte att infoga datum `%-.*s' i greylistdatabasen %s: %s

source: Set read timeout.
sv: Ställ in tidsgräns för läsning.

source: %s: invalid connection type: %s; unknown port name
sv: %s: ogiltig anslutningstyp: %s; okänt portnamn

source: cannot create opool: %s
sv: kan inte skapa opool: %s

source: -O level must be a non-negative integer
sv: -O-nivå måste vara ett icke-negativt heltal

source: fork failed: %s
sv: gaffel misslyckades: %s

source: show compilation defaults
sv: visa standardvärden för kompilering

source: cannot get URL path: %s
sv: kan inte hämta URL-sökväg: %s

source: Set file to store PID value in.
sv: Ange fil för att lagra PID-värdet i.

source: no such loop: %s
sv: ingen sådan slinga: %s

source: Set timeout for EOM.
sv: Ställ in timeout för EOM.

source: %s [%lu] stopped on signal %d
sv: %s [%lu] stoppad på signal %d

source: arg: number
sv: arg: nummer

source: previously defined here
sv: tidigare definierad här

source: invalid log level: %s
sv: ogiltig loggnivå: %s

source: heap overrun; increase #pragma stacksize
sv: överskridande av heap; öka #pragma stacksize

source: failed to connect to %s
sv: misslyckades med att ansluta till %s

source: out of memory while formatting error message:
sv: slut på minne under formatering felmeddelande:

source: cannot execute mailfromd: %s
sv: kan inte köra mailfromd: %s

source: Timeout for MAIL response.
sv: Timeout för MAIL-svar.

source: redefinition of function %s
sv: omdefiniering av funktion %s

source: invalid permissions (near %s)
sv: ogiltiga behörigheter (nära %s)

source: %s:%d: INTERNAL ERROR: no reply (%s)
sv: %s:%d: INTERNT FEL: inget svar (%s)

source: Configure MFL runtime values.
sv: Konfigurera MFL:s runtime-värden.

source: Ignored for compatibility with mailfromd
sv: Ignoreras för kompatibilitet med mailfromd

source: IP not found in the database
sv: IP finns inte i databasen

source: cannot install function %s: %s
sv: kan inte installera funktion %s: %s

source: Set email address for use in SMTP `MAIL FROM' command. Argument is an email address or a comma-separated list of addresses. Use <> for null address. Other addresses can be given without angle brackets.
sv: Ange en e-postadress som ska användas i SMTP-kommandot `MAIL FROM'. Argumentet är en e-postadress eller en kommaseparerad lista med adresser. Använd <> för nolladresser. Andra adresser kan anges utan vinkelparenteser.

source: cannot convert literal to number
sv: kan inte konvertera bokstav till tal

source: URL to listen on was not specified
sv: URL för att lyssna på angavs inte

source: $@ cannnot be used to supply actual arguments for mandatory or optional parameters
sv: $@ kan inte användas för att ange faktiska argument för obligatoriska eller valfria parametrar

source: cannot open %s: %s
sv: kan inte öppna %s: %s

source: pipe: %s
sv: rör: %s

source: $@ is allowed only in variadic functions
sv: $@ är endast tillåtet i variadiska funktioner

source: cannot fetch data `%*.*s' from `%s': %s
sv: kan inte hämta data `%*.*s' från `%s': %s

source: index out of range: %ld
sv: index utanför intervallet: %ld

source: interactive mode
sv: interaktivt läge

source: assign VALUE to VAR
sv: tilldela VALUE till VAR

source: %s: cannot get host: %s
sv: %s: kan inte hämta värd: %s

source: Read DNS configuration from this file (default: /etc/resolv.conf)
sv: Läs DNS-konfigurationen från den här filen (standard: /etc/resolv.conf)

source: use either --stdio or --daemon
sv: använd antingen --stdio eller --daemon

source: write error on %s: %s
sv: skrivfel på %s: %s

source: setgroups failed: %s
sv: setgroups misslyckades: %s

source: DNS resolver configuration.
sv: Konfiguration av DNS-resolver.

source: %s: cannot set close-on-exec: %s
sv: %s: kan inte ställa in close-on-exec: %s

source: cannot create trace stream, using standard log: %s
sv: kan inte skapa spårström, använder standardlogg: %s

source: cannot convert `%s' to number
sv: kan inte konvertera `%s' till ett tal

source: Switch to this user privileges after startup.
sv: Byt till denna användarrättighet efter uppstart.

source: unclosed character class near %s
sv: oavslutad karaktärsklass nära %s

source: invalid dynamic library handle
sv: ogiltigt dynamiskt bibliotekshandtag

source: uncaught exception %s: %s
sv: oavsiktligt undantag %s: %s

source: invalid resolve family value
sv: ogiltig upplösning familjevärde

source: mailfromd -- a general purpose milter daemon
sv: mailfromd -- en milter-daemon för allmänt bruk

source: unable to open database %s: %s
sv: det går inte att öppna databasen %s: %s

source: Write PID to this file.
sv: Skriv PID till den här filen.

source: number of arguments doesn't satisfy type string
sv: antalet argument uppfyller inte typen string

source: protocol abilities %#lx do not match MTA milter abilities %#lx
sv: protokollets förmågor %#lx stämmer inte överens med MTA:s miltärförmågor %#lx

source: invalid URL: %s
sv: ogiltig URL: %s

source: Configure file mode for database files
sv: Konfigurera filläge för databasfiler

source: cannot fetch `%s' from `%s': %s
sv: kan inte hämta `%s' från `%s': %s

source: %s has no MX records
sv: %s har inga MX-poster

source: cannot create URL from `%s': %s
sv: kan inte skapa URL från `%s': %s

source: unexpected list
sv: oväntad lista

source: invalid transform string "%s": %s
sv: ogiltig transformsträng "%s": %s

source: no servers configured
sv: inga servrar konfigurerade

source: set name of the TLS key file
sv: ange namn på TLS-nyckelfilen

source: when running as root, --user option is mandatory.
sv: när du kör som root är alternativet --user obligatoriskt.

source: unsupported protocol: %s
sv: protokoll som inte stöds: %s

source: %s: not a valid X spec, invalid delimiter near %s
sv: %s: inte en giltig X-specifikation, ogiltigt avgränsningstecken nära %s

source: invalid size: numeric overflow occurred
sv: ogiltig storlek: numeriskt överflöd inträffade

source: name: string
sv: namn: sträng

source: Set remote client URL.
sv: Ange URL för fjärrklient.

source: cannot create mailer `%s': %s
sv: kan inte skapa mailer `%s': %s

source: select logger stream
sv: välj loggerström

source: invalid IP address: %s
sv: ogiltig IP-adress: %s

source: duplicate variable: %s
sv: duplicera variabel: %s

source: right-hand side argument to the arithmetical operation is of wrong data type
sv: höger sidas argument till den aritmetiska operationen är av fel datatyp

source: failed to connect to %s (milter %s)
sv: misslyckades med att ansluta till %s (milter %s)

source: argument parsing failed
sv: parsning av argument misslyckades

source: not a valid IP or CIDR: %s
sv: inte en giltig IP eller CIDR: %s

source: use command as external preprocessor
sv: använda kommandot som extern preprocessor

source: group: string
sv: grupp: sträng

source: set name of the TLS certificate file
sv: ange namn på TLS-certifikatfilen

source: Default database type
sv: Standardtyp av databas

source: Set database record expiration interval
sv: Ange utgångsintervall för databasposter

source: automatic variable `%s' is shadowing a global
sv: automatiska variabeln `%s' skuggar en global

source: expected string or list of strings
sv: förväntad sträng eller lista med strängar

source: can't read private key from %s: %s
sv: kan inte läsa privat nyckel från %s: %s

source: cannot drop non-root setuid privileges
sv: kan inte släppa setuid-privilegier för icke-root

source: undefine a preprocessor symbol NAME
sv: avdefiniera en preprocessorsymbol NAME

source: unknown syslog facility (%s), redirecting stderr to %s
sv: okänd syslog-funktion (%s), omdirigerar stderr till %s

source: division by zero
sv: division med noll

source: MFL preprocessor configuration.
sv: Konfiguration av MFL-preprocessor.

source: unsupported address family
sv: adressfamilj som inte stöds

source: cannot install builtin function %s: %s
sv: kan inte installera inbyggd funktion %s: %s

source: cannot fetch data: %s
sv: kan inte hämta data: %s

source: send header: size=%lu, cmd=%c
sv: sändningshuvud: storlek=%lu, cmd=%c

source: select failed: %s
sv: select misslyckades: %s

source: buffer
sv: buffert

source: stay in foreground
sv: hålla sig i förgrunden

source: bad buffering type: %ld
sv: dålig buffringstyp: %ld

source: can't allocate stream buffer
sv: kan inte allokera strömbuffert

source: %s: cannot bind to port %s: %s
sv: %s: kan inte binda till port %s: %s

source: cannot create transcript stream: %s; transcript disabled
sv: kan inte skapa avskriftsström: %s; avskrift inaktiverad

source: out of stack space; increase #pragma stacksize
sv: slut på stackutrymme; öka #pragma stacksize

source: can't parse connection string %s
sv: kan inte tolka anslutningssträngen %s

source: Invalid milter timeout: %lu
sv: Ogiltig milter timeout: %lu

source: Server-dependent options
sv: Serverberoende alternativ

source: DKIM failed
sv: DKIM misslyckades

source: cannot reverse IP %s
sv: kan inte vända IP %s

source: Use the SMTP VRFY command, when available.
sv: Använd kommandot SMTP VRFY om det finns tillgängligt.

source: send data
sv: skicka data

source: mf_dbm_open(%s) failed: %s
sv: mf_dbm_open(%s) misslyckades: %s

source: can't convert from charset %s to %s: %s
sv: kan inte konvertera från charset %s till %s: %s

source: too few arguments in pragma
sv: för få argument i pragma

source: initial allocation for built-in private data #%d failed
sv: initial tilldelning för inbyggda privata data #%d misslyckades

source: modules: list
sv: moduler: lista

source: invalid extended reply code
sv: ogiltig kod för utökat svar

source: set pidfile name
sv: set pidfile namn

source: dump parser tree
sv: dumpa parser träd
